[
  {
    "question": "Show me all museums in London.",
    "entities": [
      "London"
    ],
    "properties": [
      "instance of",
      "located in the administrative territorial entity"
    ],
    "entities_matches": {
      "London": [
        {
          "id": "Q84",
          "label": "London",
          "description": "capital and largest city of England and the United Kingdom",
          "url": "//www.wikidata.org/wiki/Q84"
        },
        {
          "id": "Q1137581",
          "label": "The London Gazette",
          "description": "journal of record of the British government",
          "url": "//www.wikidata.org/wiki/Q1137581"
        },
        {
          "id": "Q20003780",
          "label": "London",
          "description": "unisex given name",
          "url": "//www.wikidata.org/wiki/Q20003780"
        },
        {
          "id": "Q92561",
          "label": "London",
          "description": "city in Southwestern Ontario, Canada",
          "url": "//www.wikidata.org/wiki/Q92561"
        },
        {
          "id": "Q23311",
          "label": "City of London",
          "description": "city, ceremonial county and local government district that contains the historic center and the primary central business district in the London Region in England, UK",
          "url": "//www.wikidata.org/wiki/Q23311"
        }
      ]
    },
    "properties_matches": {
      "all_matches": [
        {
          "id": "P10114",
          "label": "Natural History Museum (London) person ID",
          "description": "identifier for a person (including 'legal person', such as a company)  in the Natural History Museum (London) archives"
        },
        {
          "id": "P10873",
          "label": "Mapping Museums ID",
          "description": "identifier for a UK museum existing in the 1960 to 2022 period, in Mapping Museums database"
        },
        {
          "id": "P12035",
          "label": "MyShows show ID",
          "description": "identifier of TV show at online social database myshows.me"
        },
        {
          "id": "P12795",
          "label": "showrunner",
          "description": "person who is responsible for the day-to-day operation of a television show"
        },
        {
          "id": "P12898",
          "label": "Museums in Russia ID",
          "description": "identifier of a museum page on the website \"Museums in Russia\""
        },
        {
          "id": "P13249",
          "label": "Museum Data Service museum ID",
          "description": "identifier for a museum or museum collection in the UK (also Channel Islands and Isle of Man), in the MDS database"
        },
        {
          "id": "P13466",
          "label": "National Gallery (London) PID",
          "description": "PID for a topic, in the National Gallery (London) online catalogue"
        },
        {
          "id": "P3633",
          "label": "British Museum place ID",
          "description": "identifier for a place in the British Museum thesaurus"
        },
        {
          "id": "P371",
          "label": "presenter",
          "description": "main role in presenting a radio or television program or a performing arts show"
        },
        {
          "id": "P5030",
          "label": "talk show guest",
          "description": "person invited in a talk show"
        },
        {
          "id": "P608",
          "label": "exhibition history",
          "description": "exhibitions where the item is or was displayed"
        },
        {
          "id": "P7917",
          "label": "Museums in Austria Code",
          "description": "Registration Code from the association of museums in Austria"
        },
        {
          "id": "P8657",
          "label": "photoLondon ID",
          "description": "identifier for the photoLondon database"
        },
        {
          "id": "P9009",
          "label": "RadioPublic show ID",
          "description": "identifier for a podcast on RadioPublic"
        },
        {
          "id": "P9593",
          "label": "Museums in Styria ID",
          "description": "identifier for a museum in Styria, Austria"
        },
        {
          "id": "P9957",
          "label": "museum-digital place ID",
          "description": "identifier for a place in museum-digital's md:term vocabulary"
        }
      ]
    },
    "sparql": "SELECT DISTINCT?uri\nWHERE {\n  ?uri wdt:P31 wd:Q33506.\n  ?uri wdt:P276 wd:Q84.\n}"
  },
  {
    "question": "Give me all cosmonauts.",
    "entities": [
      "cosmonaut"
    ],
    "properties": [
      "instance of"
    ],
    "entities_matches": {
      "cosmonaut": [
        {
          "id": "Q11631",
          "label": "astronaut",
          "description": "person who commands, pilots, or serves as a crew member of a spacecraft",
          "url": "//www.wikidata.org/wiki/Q11631"
        },
        {
          "id": "Q12634815",
          "label": "cosmonaut",
          "description": "astronaut from the former Soviet Union and its satellite countries and today's Russia",
          "url": "//www.wikidata.org/wiki/Q12634815"
        },
        {
          "id": "Q22719",
          "label": "astronautics",
          "description": "theory and practice of navigation beyond the Earth's atmosphere",
          "url": "//www.wikidata.org/wiki/Q22719"
        },
        {
          "id": "Q5174345",
          "label": "Cosmonaut",
          "description": "2010 studio album by Bump of Chicken",
          "url": "//www.wikidata.org/wiki/Q5174345"
        },
        {
          "id": "Q3016381",
          "label": "The Cosmonaut",
          "description": "2013 film directed by Nicolás Alcalá",
          "url": "//www.wikidata.org/wiki/Q3016381"
        }
      ]
    },
    "properties_matches": {
      "all_matches": [
        {
          "id": "P450",
          "label": "astronaut mission",
          "description": "space mission that the subject is or has been a member of (do not include future missions)"
        },
        {
          "id": "P735",
          "label": "given name",
          "description": "first name or another given name of this person; values used with the property should not link disambiguations nor family names"
        }
      ]
    },
    "sparql": "SELECT DISTINCT?uri\nWHERE {\n  ?uri  wdt:P106 wd:Q11631.\n  {?uri wdt:P27 wd:Q15180 } UNION {?uri wdt:P27 wd:Q159 }\n}"
  },
  {
    "question": "Give me all cities in New Jersey with more than 100000 inhabitants.",
    "entities": [
      "New Jersey"
    ],
    "properties": [
      "population",
      "instance of"
    ],
    "entities_matches": {
      "New Jersey": [
        {
          "id": "Q1408",
          "label": "New Jersey",
          "description": "state of the United States of America",
          "url": "//www.wikidata.org/wiki/Q1408"
        },
        {
          "id": "Q2335128",
          "label": "Province of New Jersey",
          "description": "former colony in North America, part of Great Britain",
          "url": "//www.wikidata.org/wiki/Q2335128"
        },
        {
          "id": "Q779923",
          "label": "New Jersey",
          "description": "1988 studio album by Bon Jovi",
          "url": "//www.wikidata.org/wiki/Q779923"
        },
        {
          "id": "Q27712131",
          "label": "New Jersey medicine : the journal of the Medical Society of New Jersey",
          "description": "journal",
          "url": "//www.wikidata.org/wiki/Q27712131"
        },
        {
          "id": "Q572134",
          "label": "Brooklyn Nets",
          "description": "American professional basketball team",
          "url": "//www.wikidata.org/wiki/Q572134"
        }
      ]
    },
    "properties_matches": {
      "all_matches": [
        {
          "id": "P10134",
          "label": "Place Names of New Brunswick ID",
          "description": "identifier for a place in the online database Place Names of New Brunswick"
        },
        {
          "id": "P1082",
          "label": "population",
          "description": "number of people inhabiting the place; number of people of subject"
        },
        {
          "id": "P1083",
          "label": "maximum capacity",
          "description": "number of people allowed for a venue or vehicle"
        },
        {
          "id": "P1092",
          "label": "total produced",
          "description": "quantity of item produced"
        },
        {
          "id": "P11279",
          "label": "counts number of",
          "description": "this entity represents the number or quantity of this item"
        },
        {
          "id": "P12062",
          "label": "Pinakes city ID",
          "description": "numeric identifier for a city in the Pinakes database"
        },
        {
          "id": "P12114",
          "label": "Flora of New Jersey Project atlas ID",
          "description": "identifier for a plant species in the Flora of New Jersey Project atlas"
        },
        {
          "id": "P1674",
          "label": "number confirmed",
          "description": "qualifier; number of instances or occurrences classified as confirmed for reporting purposes"
        },
        {
          "id": "P2912",
          "label": "distinctive jersey",
          "description": "distinctive jersey held by a class or stage leader in a cycling competition"
        },
        {
          "id": "P4595",
          "label": "post town",
          "description": "town/city part of the postal address, can be different from administrative location"
        },
        {
          "id": "P466",
          "label": "occupant",
          "description": "person or organization occupying property"
        },
        {
          "id": "P4876",
          "label": "number of records",
          "description": "number of values of an identifier or records in a catalog"
        },
        {
          "id": "P5017",
          "label": "last update",
          "description": "date a reference was modified, revised, or updated"
        },
        {
          "id": "P6343",
          "label": "urban population",
          "description": "number of people living within the territorial entity who live in its urban parts"
        },
        {
          "id": "P7197",
          "label": "OpenWeatherMap city ID",
          "description": "identifier for a location on OpenWeatherMap (not exclusively cities)"
        },
        {
          "id": "P7328",
          "label": "amount cataloged",
          "description": "amount or size of the collection that has been described or cataloged"
        },
        {
          "id": "P735",
          "label": "given name",
          "description": "first name or another given name of this person; values used with the property should not link disambiguations nor family names"
        },
        {
          "id": "P9923",
          "label": "Umění pro město ID",
          "description": "identifier from the catalogue of public art by Gallery of the City of Prague"
        }
      ]
    },
    "sparql": "SELECT DISTINCT?uri\nWHERE {\n  ?uri wdt:P31 wd:Q515.\n  ?uri wdt:P131+ wd:Q1408.\n  ?uri wdt:P1082?population.\n  FILTER(?population > 100000)\n}"
  },
  {
    "question": "Show me Hemingway's autobiography.",
    "entities": [
      "Ernest Hemingway"
    ],
    "properties": [
      "author",
      "instance of"
    ],
    "entities_matches": {
      "Ernest Hemingway": [
        {
          "id": "Q23434",
          "label": "Ernest Hemingway",
          "description": "American author and journalist (1899–1961)",
          "url": "//www.wikidata.org/wiki/Q23434"
        },
        {
          "id": "Q47512787",
          "label": "Ernest Hemingway",
          "description": "painting by Renate Bolz",
          "url": "//www.wikidata.org/wiki/Q47512787"
        },
        {
          "id": "Q125340809",
          "label": "Ernest Hemingway",
          "description": "1978 edition of written work by Mariano Hispano González",
          "url": "//www.wikidata.org/wiki/Q125340809"
        },
        {
          "id": "Q125340800",
          "label": "Ernest Hemingway",
          "description": "written work by Mariano Hispano González",
          "url": "//www.wikidata.org/wiki/Q125340800"
        },
        {
          "id": "Q125340846",
          "label": "Ernest Hemingway",
          "description": "1979 edition of written work by Mariano Hispano González",
          "url": "//www.wikidata.org/wiki/Q125340846"
        }
      ]
    },
    "properties_matches": {
      "all_matches": [
        {
          "id": "P10033",
          "label": "Biografija.ru ID",
          "description": "identifier for a person in the biographical website Biografija.ru"
        },
        {
          "id": "P10085",
          "label": "biografiA ID",
          "description": "identifier for a person in the biographical database of Austrian women"
        },
        {
          "id": "P12035",
          "label": "MyShows show ID",
          "description": "identifier of TV show at online social database myshows.me"
        },
        {
          "id": "P12795",
          "label": "showrunner",
          "description": "person who is responsible for the day-to-day operation of a television show"
        },
        {
          "id": "P371",
          "label": "presenter",
          "description": "main role in presenting a radio or television program or a performing arts show"
        },
        {
          "id": "P4434",
          "label": "LesBiographies.com ID",
          "description": "note on LesBiographies.com, a biographical dictionary edited by the Société générale de presse"
        },
        {
          "id": "P5030",
          "label": "talk show guest",
          "description": "person invited in a talk show"
        },
        {
          "id": "P6872",
          "label": "has written for",
          "description": "publication an author has contributed to"
        },
        {
          "id": "P9009",
          "label": "RadioPublic show ID",
          "description": "identifier for a podcast on RadioPublic"
        }
      ]
    },
    "sparql": "SELECT DISTINCT?uri\nWHERE {\n  ?uri wdt:P50 wd:Q23434.\n  ?uri wdt:P136 wd:Q4184.\n}"
  }
]