[
  {
    "question": "Show me all basketball players that are higher than 2 meters.",
    "entities": [
      "basketball player"
    ],
    "properties": [
      "occupation",
      "height"
    ],
    "entities_matches": {
      "basketball player": [
        {
          "id": "Q3665646",
          "label": "basketball player",
          "description": "person who plays in basketball",
          "url": "//www.wikidata.org/wiki/Q3665646"
        },
        {
          "id": "Q42571251",
          "label": "Basketball Player",
          "description": "character from 2014 film 'Zapped'",
          "url": "//www.wikidata.org/wiki/Q42571251"
        },
        {
          "id": "Q97142647",
          "label": "Basketbalista",
          "description": "1985 bronze statue by František Mrázek, situated in front of the sports hall in České Budějovice, South Bohemian Region, Czechia",
          "url": "//www.wikidata.org/wiki/Q97142647"
        },
        {
          "id": "Q106769321",
          "label": "Basketball Player - Plus",
          "description": "painting by James Edward Davis",
          "url": "//www.wikidata.org/wiki/Q106769321"
        },
        {
          "id": "Q28811411",
          "label": "basketball player #18",
          "description": "fictional character from The Absent-Minded Professor",
          "url": "//www.wikidata.org/wiki/Q28811411"
        }
      ]
    },
    "properties_matches": {
      "occupation": [
        {
          "id": "P106",
          "label": "occupation",
          "description": "occupation of a person; see also \"field of work\" (Property:P101), \"position held\" (Property:P39)",
          "url": "//www.wikidata.org/wiki/Property:P106"
        },
        {
          "id": "P3095",
          "label": "practiced by",
          "description": "type of agents that study this subject or work in this field",
          "url": "//www.wikidata.org/wiki/Property:P3095"
        },
        {
          "id": "P3989",
          "label": "members have occupation",
          "description": "some or all members of this group share the occupation",
          "url": "//www.wikidata.org/wiki/Property:P3989"
        },
        {
          "id": "P8629",
          "label": "Occupational Outlook Handbook ID",
          "description": "identifier for occupations in the Occupational Outlook Handbook",
          "url": "//www.wikidata.org/wiki/Property:P8629"
        },
        {
          "id": "P8734",
          "label": "O*NET OnLine code",
          "description": "code for an occupation in O*NET OnLine",
          "url": "//www.wikidata.org/wiki/Property:P8734"
        }
      ],
      "height": [
        {
          "id": "P2044",
          "label": "elevation above sea level",
          "description": "height of the item (geographical object) as measured relative to sea level",
          "url": "//www.wikidata.org/wiki/Property:P2044"
        },
        {
          "id": "P2048",
          "label": "height",
          "description": "vertical length of an entity",
          "url": "//www.wikidata.org/wiki/Property:P2048"
        },
        {
          "id": "P2793",
          "label": "clearance",
          "description": "distance between surface under bridge and bottom of a bridge deck",
          "url": "//www.wikidata.org/wiki/Property:P2793"
        },
        {
          "id": "P2923",
          "label": "focal height",
          "description": "height of the lamp of a lighthouse from water level",
          "url": "//www.wikidata.org/wiki/Property:P2923"
        },
        {
          "id": "P8497",
          "label": "height of center of mass",
          "description": "distance between the center of gravity and the bottom of this object",
          "url": "//www.wikidata.org/wiki/Property:P8497"
        }
      ]
    },
    "sparql": "SELECT DISTINCT?uri\nWHERE {\n  ?uri wdt:P106 wd:Q3665646.\n  ?uri wdt:P2048?height.\n  FILTER(?height > 200)\n}"
  },
  {
    "question": "Give me all soccer clubs in the Premier League.",
    "entities": [
      "Premier League",
      "association football club"
    ],
    "properties": [
      "league or competition",
      "instance of"
    ],
    "entities_matches": {
      "Premier League": [
        {
          "id": "Q9448",
          "label": "Premier League",
          "description": "English men's association football top league",
          "url": "//www.wikidata.org/wiki/Q9448"
        },
        {
          "id": "Q206073",
          "label": "Premier League",
          "description": "top division in Ukrainian football",
          "url": "//www.wikidata.org/wiki/Q206073"
        },
        {
          "id": "Q326859",
          "label": "Azerbaijan Premier League",
          "description": "association football league",
          "url": "//www.wikidata.org/wiki/Q326859"
        },
        {
          "id": "Q2083746",
          "label": "Premijer liga",
          "description": "Croatian basketball league",
          "url": "//www.wikidata.org/wiki/Q2083746"
        },
        {
          "id": "Q19346732",
          "label": "2015–16 Premier League",
          "description": "24th season of the Premier League",
          "url": "//www.wikidata.org/wiki/Q19346732"
        }
      ],
      "association football club": [
        {
          "id": "Q476028",
          "label": "association football club",
          "description": "sports club devoted to association football (soccer)",
          "url": "//www.wikidata.org/wiki/Q476028"
        },
        {
          "id": "Q109623729",
          "label": "association football club match",
          "description": "association football match between club teams",
          "url": "//www.wikidata.org/wiki/Q109623729"
        },
        {
          "id": "Q5709550",
          "label": "Association Football Club",
          "description": "Peruvian football club",
          "url": "//www.wikidata.org/wiki/Q5709550"
        },
        {
          "id": "Q291937",
          "label": "Royale Union Tubize-Braine",
          "description": "association football club in Belgium",
          "url": "//www.wikidata.org/wiki/Q291937"
        },
        {
          "id": "Q4500008",
          "label": "Hornchurch F.C.",
          "description": "association football club in Hornchurch, England",
          "url": "//www.wikidata.org/wiki/Q4500008"
        }
      ]
    },
    "properties_matches": {
      "league or competition": [
        {
          "id": "P118",
          "label": "league or competition",
          "description": "league or competition in which team or player has played, or in which an event occurs",
          "url": "//www.wikidata.org/wiki/Property:P118"
        }
      ],
      "instance of": [
        {
          "id": "P31",
          "label": "instance of",
          "description": "type to which this subject corresponds/belongs. Different from P279 (subclass of); for example: K2 is an instance of mountain; volcanoes form a subclass of mountains, and the volcano is a type (instance) of volcanic landform",
          "url": "//www.wikidata.org/wiki/Property:P31"
        },
        {
          "id": "P10241",
          "label": "individual of taxon",
          "description": "the taxon of an individual named organism (animal, plant)",
          "url": "//www.wikidata.org/wiki/Property:P10241"
        },
        {
          "id": "P1647",
          "label": "subproperty of",
          "description": "all resources related by this property are also related by that property",
          "url": "//www.wikidata.org/wiki/Property:P1647"
        }
      ]
    },
    "sparql": "SELECT DISTINCT?uri\nWHERE {\n  ?uri wdt:P31 wd:Q476028.\n  ?uri wdt:P118 wd:Q9448.\n}"
  },
  {
    "question": "Give me all federal chancellors of Germany.",
    "entities": [
      "Federal Chancellor of Germany"
    ],
    "properties": [
      "position held"
    ],
    "entities_matches": {
      "Federal Chancellor of Germany": [
        {
          "id": "Q4970706",
          "label": "Federal Chancellor of Germany",
          "description": "head of government of the Federal Republic of Germany (1949–present)",
          "url": "//www.wikidata.org/wiki/Q4970706"
        }
      ]
    },
    "properties_matches": {
      "position held": [
        {
          "id": "P39",
          "label": "position held",
          "description": "subject currently or formerly holds the object position or public office",
          "url": "//www.wikidata.org/wiki/Property:P39"
        },
        {
          "id": "P1313",
          "label": "office held by head of government",
          "description": "political office that is fulfilled by the head of the government of this item",
          "url": "//www.wikidata.org/wiki/Property:P1313"
        },
        {
          "id": "P2388",
          "label": "position held by head of the organization",
          "description": "position of the head of this item",
          "url": "//www.wikidata.org/wiki/Property:P2388"
        },
        {
          "id": "P1308",
          "label": "position holder",
          "description": "persons who hold and/or held the position",
          "url": "//www.wikidata.org/wiki/Property:P1308"
        },
        {
          "id": "P1906",
          "label": "office held by head of state",
          "description": "political office that is fulfilled by the head of state of this item",
          "url": "//www.wikidata.org/wiki/Property:P1906"
        }
      ]
    },
    "sparql": "SELECT DISTINCT?uri\nWHERE {\n  ?uri wdt:P39 wd:Q4970706.\n}"
  },
  {
    "question": "Who created Goofy?",
    "entities": [
      "Goofy"
    ],
    "properties": [
      "creator"
    ],
    "entities_matches": {
      "Goofy": [
        {
          "id": "Q111135",
          "label": "Goofy",
          "description": "Disney cartoon character",
          "url": "//www.wikidata.org/wiki/Q111135"
        },
        {
          "id": "Q99533732",
          "label": "goofy stance",
          "description": "leading with one's right foot, in boardsports",
          "url": "//www.wikidata.org/wiki/Q99533732"
        },
        {
          "id": "Q869993",
          "label": "A Goofy Movie",
          "description": "1995 animated film directed by Kevin Lima",
          "url": "//www.wikidata.org/wiki/Q869993"
        },
        {
          "id": "Q18068088",
          "label": "GFY",
          "description": "protein-coding gene in the species Homo sapiens",
          "url": "//www.wikidata.org/wiki/Q18068088"
        },
        {
          "id": "Q18315119",
          "label": "Gfy",
          "description": "protein-coding gene in the species Mus musculus",
          "url": "//www.wikidata.org/wiki/Q18315119"
        }
      ]
    },
    "properties_matches": {
      "creator": [
        {
          "id": "P50",
          "label": "author",
          "description": "main creator(s) of a written work (use on works, not humans); use P2093 (author name string) when Wikidata item is unknown or does not exist",
          "url": "//www.wikidata.org/wiki/Property:P50"
        },
        {
          "id": "P170",
          "label": "creator",
          "description": "maker of this creative work or other object (where no more specific property exists)",
          "url": "//www.wikidata.org/wiki/Property:P170"
        },
        {
          "id": "P112",
          "label": "founded by",
          "description": "founder or co-founder of this organization, religion, place or entity",
          "url": "//www.wikidata.org/wiki/Property:P112"
        },
        {
          "id": "P6241",
          "label": "collection creator",
          "description": "entity (person, organization, etc.) that caused a record or collection to be produced or gathered",
          "url": "//www.wikidata.org/wiki/Property:P6241"
        },
        {
          "id": "P1472",
          "label": "Commons Creator page",
          "description": "name of Commons Infobox template residing in \"Creator\" namespace on Wikimedia Commons",
          "url": "//www.wikidata.org/wiki/Property:P1472"
        }
      ]
    },
    "sparql": "SELECT DISTINCT?uri\nWHERE {\n  wd:Q111135 wdt:P170?uri.\n}"
  },
  {
    "question": "Give me all books written by Danielle Steel.",
    "entities": [
      "Danielle Steel",
      "book"
    ],
    "properties": [
      "instance of",
      "author"
    ],
    "entities_matches": {
      "Danielle Steel": [
        {
          "id": "Q72653",
          "label": "Danielle Steel",
          "description": "American writer",
          "url": "//www.wikidata.org/wiki/Q72653"
        },
        {
          "id": "Q4189382",
          "label": "Danielle Steel's Star",
          "description": "1993 film directed by Michael Miller",
          "url": "//www.wikidata.org/wiki/Q4189382"
        },
        {
          "id": "Q2264138",
          "label": "Secrets",
          "description": "1992 American television film by Peter H. Hunt",
          "url": "//www.wikidata.org/wiki/Q2264138"
        },
        {
          "id": "Q7091926",
          "label": "Once in a Lifetime",
          "description": "1994 film directed by Michael Miller",
          "url": "//www.wikidata.org/wiki/Q7091926"
        },
        {
          "id": "Q4994471",
          "label": "Changes",
          "description": "1991 television film directed by Charles Jarrott",
          "url": "//www.wikidata.org/wiki/Q4994471"
        }
      ],
      "book": [
        {
          "id": "Q571",
          "label": "book",
          "description": "medium for recording information (words or images) typically on bound pages or more abstractly in electronic or audio form",
          "url": "//www.wikidata.org/wiki/Q571"
        },
        {
          "id": "Q16860229",
          "label": "Book",
          "description": "family name",
          "url": "//www.wikidata.org/wiki/Q16860229"
        },
        {
          "id": "Q1261026",
          "label": "printed matter",
          "description": "printed material produced by printers or publishers",
          "url": "//www.wikidata.org/wiki/Q1261026"
        },
        {
          "id": "Q53731850",
          "label": "individual copy of a book",
          "description": "specific physical copy of a book",
          "url": "//www.wikidata.org/wiki/Q53731850"
        },
        {
          "id": "Q1238720",
          "label": "volume",
          "description": "book in a series, typically identified sequentially (e.g. Volume 3)",
          "url": "//www.wikidata.org/wiki/Q1238720"
        }
      ]
    },
    "properties_matches": {
      "instance of": [
        {
          "id": "P31",
          "label": "instance of",
          "description": "type to which this subject corresponds/belongs. Different from P279 (subclass of); for example: K2 is an instance of mountain; volcanoes form a subclass of mountains, and the volcano is a type (instance) of volcanic landform",
          "url": "//www.wikidata.org/wiki/Property:P31"
        },
        {
          "id": "P10241",
          "label": "individual of taxon",
          "description": "the taxon of an individual named organism (animal, plant)",
          "url": "//www.wikidata.org/wiki/Property:P10241"
        },
        {
          "id": "P1647",
          "label": "subproperty of",
          "description": "all resources related by this property are also related by that property",
          "url": "//www.wikidata.org/wiki/Property:P1647"
        }
      ],
      "author": [
        {
          "id": "P50",
          "label": "author",
          "description": "main creator(s) of a written work (use on works, not humans); use P2093 (author name string) when Wikidata item is unknown or does not exist",
          "url": "//www.wikidata.org/wiki/Property:P50"
        },
        {
          "id": "P676",
          "label": "lyricist",
          "description": "author of song lyrics",
          "url": "//www.wikidata.org/wiki/Property:P676"
        },
        {
          "id": "P2093",
          "label": "author name string",
          "description": "stores unspecified author or editor name for publications; use if Wikidata item for author (P50) or editor (P98) does not exist or is not known. Do not use both.",
          "url": "//www.wikidata.org/wiki/Property:P2093"
        },
        {
          "id": "P1932",
          "label": "object named as",
          "description": "use as qualifier to indicate how the object's value was given in the source",
          "url": "//www.wikidata.org/wiki/Property:P1932"
        },
        {
          "id": "P1810",
          "label": "subject named as",
          "description": "name by which a subject is recorded in a database, mentioned as a contributor of a work, or is referred to in a particular context",
          "url": "//www.wikidata.org/wiki/Property:P1810"
        }
      ]
    },
    "sparql": "SELECT DISTINCT?uri\nWHERE {\n  ?uri wdt:P31 wd:Q571.\n  ?uri wdt:P50 wd:Q72653.\n}"
  },
  {
    "question": "Give me the birthdays of all actors of the television show Charmed.",
    "entities": [
      "Charmed"
    ],
    "properties": [
      "cast member",
      "date of birth"
    ],
    "entities_matches": {
      "Charmed": [
        {
          "id": "Q162371",
          "label": "Charmed",
          "description": "American supernatural drama / fantasy television series (1998–2006)",
          "url": "//www.wikidata.org/wiki/Q162371"
        },
        {
          "id": "Q53162693",
          "label": "Charmed",
          "description": "American television series, reboot of Charmed (1998–2006)",
          "url": "//www.wikidata.org/wiki/Q53162693"
        },
        {
          "id": "Q2564039",
          "label": "Charmed",
          "description": "comic book that is an officially licensed continuation of the popular The WB television series of the same name",
          "url": "//www.wikidata.org/wiki/Q2564039"
        },
        {
          "id": "Q1067576",
          "label": "Charmed",
          "description": "Norwegian musical group",
          "url": "//www.wikidata.org/wiki/Q1067576"
        },
        {
          "id": "Q5086449",
          "label": "Charmed",
          "description": "video game based on the fourth season of the television series of the same name",
          "url": "//www.wikidata.org/wiki/Q5086449"
        }
      ]
    },
    "properties_matches": {
      "cast member": [
        {
          "id": "P161",
          "label": "cast member",
          "description": "actor in the subject production [use \"character role\" (P453) and/or \"name of the character role\" (P4633) as qualifiers] [use \"voice actor\" (P725) for voice-only role] - [use \"recorded participant\" (P11108) for non-fiction productions]",
          "url": "//www.wikidata.org/wiki/Property:P161"
        }
      ],
      "date of birth": [
        {
          "id": "P569",
          "label": "date of birth",
          "description": "date on which the subject was born",
          "url": "//www.wikidata.org/wiki/Property:P569"
        }
      ]
    },
    "sparql": "SELECT DISTINCT?date\nWHERE {\n  wd:Q162371 wdt:P161/wdt:P569?date.\n}"
  },
  {
    "question": "Give me all soccer clubs in Spain.",
    "entities": [
      "Spain",
      "association football club"
    ],
    "properties": [
      "country",
      "instance of"
    ],
    "entities_matches": {
      "Spain": [
        {
          "id": "Q29",
          "label": "Spain",
          "description": "country in southwestern Europe with territories in Africa",
          "url": "//www.wikidata.org/wiki/Q29"
        },
        {
          "id": "Q16932431",
          "label": "Spain",
          "description": "family name",
          "url": "//www.wikidata.org/wiki/Q16932431"
        },
        {
          "id": "Q42267",
          "label": "Spain men's national football team",
          "description": "men's national association football team representing Spain",
          "url": "//www.wikidata.org/wiki/Q42267"
        },
        {
          "id": "Q178038",
          "label": "Second Spanish Republic",
          "description": "political regime established in Spain between April 14, 1931 and April 1, 1939",
          "url": "//www.wikidata.org/wiki/Q178038"
        },
        {
          "id": "Q170603",
          "label": "New Spain",
          "description": "viceroyalty of the Spanish Empire (1535-1821)",
          "url": "//www.wikidata.org/wiki/Q170603"
        }
      ],
      "association football club": [
        {
          "id": "Q476028",
          "label": "association football club",
          "description": "sports club devoted to association football (soccer)",
          "url": "//www.wikidata.org/wiki/Q476028"
        },
        {
          "id": "Q109623729",
          "label": "association football club match",
          "description": "association football match between club teams",
          "url": "//www.wikidata.org/wiki/Q109623729"
        },
        {
          "id": "Q5709550",
          "label": "Association Football Club",
          "description": "Peruvian football club",
          "url": "//www.wikidata.org/wiki/Q5709550"
        },
        {
          "id": "Q291937",
          "label": "Royale Union Tubize-Braine",
          "description": "association football club in Belgium",
          "url": "//www.wikidata.org/wiki/Q291937"
        },
        {
          "id": "Q4500008",
          "label": "Hornchurch F.C.",
          "description": "association football club in Hornchurch, England",
          "url": "//www.wikidata.org/wiki/Q4500008"
        }
      ]
    },
    "properties_matches": {
      "country": [
        {
          "id": "P17",
          "label": "country",
          "description": "sovereign state that this item is in (not to be used for human beings)",
          "url": "//www.wikidata.org/wiki/Property:P17"
        },
        {
          "id": "P27",
          "label": "country of citizenship",
          "description": "the object is a country that recognizes the subject as its citizen",
          "url": "//www.wikidata.org/wiki/Property:P27"
        },
        {
          "id": "P495",
          "label": "country of origin",
          "description": "country of origin of this item (creative work, food, phrase, product, etc.)",
          "url": "//www.wikidata.org/wiki/Property:P495"
        },
        {
          "id": "P3005",
          "label": "valid in place",
          "description": "place where a statement is valid",
          "url": "//www.wikidata.org/wiki/Property:P3005"
        },
        {
          "id": "P1001",
          "label": "applies to jurisdiction",
          "description": "the item (institution, law, public office, public register, etc) or statement belongs to or has power over or applies to the value (a territorial jurisdiction: a country, state, municipality, etc)",
          "url": "//www.wikidata.org/wiki/Property:P1001"
        }
      ],
      "instance of": [
        {
          "id": "P31",
          "label": "instance of",
          "description": "type to which this subject corresponds/belongs. Different from P279 (subclass of); for example: K2 is an instance of mountain; volcanoes form a subclass of mountains, and the volcano is a type (instance) of volcanic landform",
          "url": "//www.wikidata.org/wiki/Property:P31"
        },
        {
          "id": "P10241",
          "label": "individual of taxon",
          "description": "the taxon of an individual named organism (animal, plant)",
          "url": "//www.wikidata.org/wiki/Property:P10241"
        },
        {
          "id": "P1647",
          "label": "subproperty of",
          "description": "all resources related by this property are also related by that property",
          "url": "//www.wikidata.org/wiki/Property:P1647"
        }
      ]
    },
    "sparql": "SELECT DISTINCT?uri\nWHERE {\n  ?uri wdt:P31 wd:Q476028.\n  ?uri wdt:P17 wd:Q29.\n}"
  },
  {
    "question": "List all episodes of the first season of the HBO television series The Sopranos.",
    "entities": [
      "television series episode",
      "The Sopranos, season 1"
    ],
    "properties": [
      "part of",
      "instance of"
    ],
    "entities_matches": {
      "television series episode": [
        {
          "id": "Q21191270",
          "label": "television series episode",
          "description": "single installment of a television series",
          "url": "//www.wikidata.org/wiki/Q21191270"
        }
      ],
      "The Sopranos, season 1": [
        {
          "id": "Q5274359",
          "label": "The Sopranos, season 1",
          "description": "season of television series",
          "url": "//www.wikidata.org/wiki/Q5274359"
        }
      ]
    },
    "properties_matches": {
      "part of": [
        {
          "id": "P361",
          "label": "part of",
          "description": "object of which the subject is a part (if this subject is already part of object A which is a part of object B, then please only make the subject part of object A), inverse property of \"has part\" (P527, see also \"has parts of the class\" (P2670))",
          "url": "//www.wikidata.org/wiki/Property:P361"
        },
        {
          "id": "P749",
          "label": "parent organization",
          "description": "parent organization of an organization, opposite of subsidiaries (P355)",
          "url": "//www.wikidata.org/wiki/Property:P749"
        },
        {
          "id": "P1433",
          "label": "published in",
          "description": "larger work that a given work was published in, like a journal, a website, a collection, a book or a music album",
          "url": "//www.wikidata.org/wiki/Property:P1433"
        },
        {
          "id": "P59",
          "label": "constellation",
          "description": "the area of the celestial sphere of which the subject is a part (from a scientific standpoint, not an astrological one)",
          "url": "//www.wikidata.org/wiki/Property:P59"
        },
        {
          "id": "P5008",
          "label": "on focus list of Wikimedia project",
          "description": "property to indicate that an item is of particular interest for a Wikimedia project. This property does not add notability. Items should not be created with this property if they are not notable for Wikidata. See also P6104, P972, P2354.",
          "url": "//www.wikidata.org/wiki/Property:P5008"
        }
      ],
      "instance of": [
        {
          "id": "P31",
          "label": "instance of",
          "description": "type to which this subject corresponds/belongs. Different from P279 (subclass of); for example: K2 is an instance of mountain; volcanoes form a subclass of mountains, and the volcano is a type (instance) of volcanic landform",
          "url": "//www.wikidata.org/wiki/Property:P31"
        },
        {
          "id": "P10241",
          "label": "individual of taxon",
          "description": "the taxon of an individual named organism (animal, plant)",
          "url": "//www.wikidata.org/wiki/Property:P10241"
        },
        {
          "id": "P1647",
          "label": "subproperty of",
          "description": "all resources related by this property are also related by that property",
          "url": "//www.wikidata.org/wiki/Property:P1647"
        }
      ]
    },
    "sparql": "SELECT DISTINCT?uri\nWHERE {\n  ?uri wdt:P31 wd:Q21191270.\n  ?uri wdt:P361 wd:Q5274359.\n}"
  },
  {
    "question": "Show me all books in Asimov's Foundation series.",
    "entities": [
      "Foundation series"
    ],
    "properties": [
      "has part(s)"
    ],
    "entities_matches": {
      "Foundation series": [
        {
          "id": "Q1564644",
          "label": "Foundation series",
          "description": "series of science fiction books by Isaac Asimov",
          "url": "//www.wikidata.org/wiki/Q1564644"
        }
      ]
    },
    "properties_matches": {
      "has part(s)": [
        {
          "id": "P527",
          "label": "has part(s)",
          "description": "part of this subject; inverse property of \"part of\" (P361). See also \"has parts of the class\" (P2670).",
          "url": "//www.wikidata.org/wiki/Property:P527"
        },
        {
          "id": "P2670",
          "label": "has part(s) of the class",
          "description": "the subject has one or more parts of the object class",
          "url": "//www.wikidata.org/wiki/Property:P2670"
        }
      ]
    },
    "sparql": "SELECT DISTINCT?uri\nWHERE {\n  wd:Q1564644 wdt:P527?uri.\n}"
  },
  {
    "question": "Give me the grandchildren of Elvis Presley.",
    "entities": [
      "Elvis Presley"
    ],
    "properties": [
      "child"
    ],
    "entities_matches": {
      "Elvis Presley": [
        {
          "id": "Q303",
          "label": "Elvis Presley",
          "description": "American singer and actor (1935–1977)",
          "url": "//www.wikidata.org/wiki/Q303"
        },
        {
          "id": "Q610926",
          "label": "Elvis Presley",
          "description": "1956 self-titled debut studio album by Elvis Presley",
          "url": "//www.wikidata.org/wiki/Q610926"
        },
        {
          "id": "Q83488456",
          "label": "Elvis Presley",
          "description": "1956 US LP by Elvis Presley; RCA Victor ‎– LPM-1254",
          "url": "//www.wikidata.org/wiki/Q83488456"
        },
        {
          "id": "Q47509719",
          "label": "Elvis Presley",
          "description": "painting by Ralph Wolfe Cowan",
          "url": "//www.wikidata.org/wiki/Q47509719"
        },
        {
          "id": "Q59150527",
          "label": "Elvis Presley's albums in chronological order",
          "description": "Wikimedia albums discography",
          "url": "//www.wikidata.org/wiki/Q59150527"
        }
      ]
    },
    "properties_matches": {
      "child": [
        {
          "id": "P40",
          "label": "child",
          "description": "subject has object as child. Do not use for stepchildren—use \"relative\" (P1038), qualified with \"type of kinship\" (P1039)",
          "url": "//www.wikidata.org/wiki/Property:P40"
        },
        {
          "id": "P22",
          "label": "father",
          "description": "male parent of the subject. For stepfather, use \"stepparent\" (P3448)",
          "url": "//www.wikidata.org/wiki/Property:P22"
        },
        {
          "id": "P25",
          "label": "mother",
          "description": "female parent of the subject. For stepmother, use \"stepparent\" (P3448)",
          "url": "//www.wikidata.org/wiki/Property:P25"
        },
        {
          "id": "P1971",
          "label": "number of children",
          "description": "number of children of the person, animal, or character",
          "url": "//www.wikidata.org/wiki/Property:P1971"
        },
        {
          "id": "P6191",
          "label": "language style",
          "description": "to denote of the way a sense of a word is used, e.g., slang, vulgarism, babytalk, colloquialism, etc.",
          "url": "//www.wikidata.org/wiki/Property:P6191"
        }
      ]
    },
    "sparql": "SELECT DISTINCT?o2\nWHERE {\n  wd:Q303  wdt:P40  ?o1.\n  ?o1  wdt:P40?o2.\n}"
  }
]