[
  {
    "question": "Show me the book that Muhammad Ali wrote.",
    "entities": [
      "Muhammad Ali",
      "book"
    ],
    "properties": [
      "instance of",
      "author"
    ],
    "entities_matches": {
      "Muhammad Ali": [
        {
          "id": "Q36107",
          "label": "Muhammad Ali",
          "description": "American boxer (1942–2016)",
          "url": "//www.wikidata.org/wiki/Q36107"
        },
        {
          "id": "Q101070987",
          "label": "Muhammad Ali",
          "description": "",
          "url": "//www.wikidata.org/wiki/Q101070987"
        },
        {
          "id": "Q336440",
          "label": "Muhammad Ali",
          "description": "Pakistani scholar and leading figure of the Ahmadiyya Movement",
          "url": "//www.wikidata.org/wiki/Q336440"
        },
        {
          "id": "Q182781",
          "label": "Muhammad Ali",
          "description": "Albanian Ottoman commander and Wali of Egypt and Sudan (1769–1849)",
          "url": "//www.wikidata.org/wiki/Q182781"
        },
        {
          "id": "Q60959993",
          "label": "Mohammad-Ali",
          "description": "male given name",
          "url": "//www.wikidata.org/wiki/Q60959993"
        }
      ],
      "book": [
        {
          "id": "Q571",
          "label": "book",
          "description": "medium for recording information (words or images) typically on bound pages or more abstractly in electronic or audio form",
          "url": "//www.wikidata.org/wiki/Q571"
        },
        {
          "id": "Q16860229",
          "label": "Book",
          "description": "family name",
          "url": "//www.wikidata.org/wiki/Q16860229"
        },
        {
          "id": "Q1261026",
          "label": "printed matter",
          "description": "printed material produced by printers or publishers",
          "url": "//www.wikidata.org/wiki/Q1261026"
        },
        {
          "id": "Q53731850",
          "label": "individual copy of a book",
          "description": "specific physical copy of a book",
          "url": "//www.wikidata.org/wiki/Q53731850"
        },
        {
          "id": "Q1238720",
          "label": "volume",
          "description": "book in a series, typically identified sequentially (e.g. Volume 3)",
          "url": "//www.wikidata.org/wiki/Q1238720"
        }
      ]
    },
    "properties_matches": {
      "instance of": [
        {
          "id": "P31",
          "label": "instance of",
          "description": "type to which this subject corresponds/belongs. Different from P279 (subclass of); for example: K2 is an instance of mountain; volcanoes form a subclass of mountains, and the volcano is a type (instance) of volcanic landform",
          "url": "//www.wikidata.org/wiki/Property:P31"
        },
        {
          "id": "P10241",
          "label": "individual of taxon",
          "description": "the taxon of an individual named organism (animal, plant)",
          "url": "//www.wikidata.org/wiki/Property:P10241"
        },
        {
          "id": "P1647",
          "label": "subproperty of",
          "description": "all resources related by this property are also related by that property",
          "url": "//www.wikidata.org/wiki/Property:P1647"
        }
      ],
      "author": [
        {
          "id": "P50",
          "label": "author",
          "description": "main creator(s) of a written work (use on works, not humans); use P2093 (author name string) when Wikidata item is unknown or does not exist",
          "url": "//www.wikidata.org/wiki/Property:P50"
        },
        {
          "id": "P676",
          "label": "lyricist",
          "description": "author of song lyrics",
          "url": "//www.wikidata.org/wiki/Property:P676"
        },
        {
          "id": "P2093",
          "label": "author name string",
          "description": "stores unspecified author or editor name for publications; use if Wikidata item for author (P50) or editor (P98) does not exist or is not known. Do not use both.",
          "url": "//www.wikidata.org/wiki/Property:P2093"
        },
        {
          "id": "P1932",
          "label": "object named as",
          "description": "use as qualifier to indicate how the object's value was given in the source",
          "url": "//www.wikidata.org/wiki/Property:P1932"
        },
        {
          "id": "P1810",
          "label": "subject named as",
          "description": "name by which a subject is recorded in a database, mentioned as a contributor of a work, or is referred to in a particular context",
          "url": "//www.wikidata.org/wiki/Property:P1810"
        }
      ]
    },
    "sparql": "SELECT DISTINCT?uri\nWHERE {\n  ?uri wdt:P31 wd:Q571.\n  ?uri wdt:P50 wd:Q36107.\n}"
  },
  {
    "question": "Give me the currency of China.",
    "entities": [
      "People's Republic of China"
    ],
    "properties": [
      "currency"
    ],
    "entities_matches": {
      "People's Republic of China": [
        {
          "id": "Q148",
          "label": "People's Republic of China",
          "description": "country in East Asia",
          "url": "//www.wikidata.org/wiki/Q148"
        },
        {
          "id": "Q22828645",
          "label": "People's Republic of China",
          "description": "Wikimedia permanent duplicate item",
          "url": "//www.wikidata.org/wiki/Q22828645"
        },
        {
          "id": "Q936190",
          "label": "Government of the People's Republic of China",
          "description": "administrative bodies of China",
          "url": "//www.wikidata.org/wiki/Q936190"
        },
        {
          "id": "Q10872045",
          "label": "Classification and code of disciplines",
          "description": "",
          "url": "//www.wikidata.org/wiki/Q10872045"
        },
        {
          "id": "Q862552",
          "label": "history of the People's Republic of China",
          "description": "aspect of history",
          "url": "//www.wikidata.org/wiki/Q862552"
        }
      ]
    },
    "properties_matches": {
      "currency": [
        {
          "id": "P38",
          "label": "currency",
          "description": "currency used by item",
          "url": "//www.wikidata.org/wiki/Property:P38"
        },
        {
          "id": "P498",
          "label": "ISO 4217 code",
          "description": "identifier for a currency per ISO 4217",
          "url": "//www.wikidata.org/wiki/Property:P498"
        },
        {
          "id": "P489",
          "label": "currency symbol description",
          "description": "item with description of currency symbol",
          "url": "//www.wikidata.org/wiki/Property:P489"
        }
      ]
    },
    "sparql": "SELECT?o1\nWHERE {\n  wd:Q148  wdt:P38  ?o1.\n}"
  },
  {
    "question": "Give me all Swedish oceanographers.",
    "entities": [
      "Sweden",
      "oceanographer"
    ],
    "properties": [
      "occupation",
      "country of citizenship"
    ],
    "entities_matches": {
      "Sweden": [
        {
          "id": "Q34",
          "label": "Sweden",
          "description": "country in Northern Europe",
          "url": "//www.wikidata.org/wiki/Q34"
        },
        {
          "id": "Q37437749",
          "label": "Sweden",
          "description": "family name",
          "url": "//www.wikidata.org/wiki/Q37437749"
        },
        {
          "id": "Q7654287",
          "label": "Sweden",
          "description": "constituency of the European Parliament",
          "url": "//www.wikidata.org/wiki/Q7654287"
        },
        {
          "id": "Q118948494",
          "label": "Sweden",
          "description": "song by C418",
          "url": "//www.wikidata.org/wiki/Q118948494"
        },
        {
          "id": "Q125765069",
          "label": "Sweden",
          "description": "instrumental track by C418; 2011 studio recording",
          "url": "//www.wikidata.org/wiki/Q125765069"
        }
      ],
      "oceanographer": [
        {
          "id": "Q3546255",
          "label": "oceanographer",
          "description": "scientist who studies oceans",
          "url": "//www.wikidata.org/wiki/Q3546255"
        },
        {
          "id": "Q55536132",
          "label": "Oceanographer Fracture Zone",
          "description": "",
          "url": "//www.wikidata.org/wiki/Q55536132"
        },
        {
          "id": "Q116506694",
          "label": "Oceanographer Canyon",
          "description": "submarine canyon in offshore Canadian waters",
          "url": "//www.wikidata.org/wiki/Q116506694"
        },
        {
          "id": "Q39524695",
          "label": "Oceanographers' contribution to climate modelling and prediction: progress to date and a future perspective.",
          "description": "scientific article published on December 2012",
          "url": "//www.wikidata.org/wiki/Q39524695"
        },
        {
          "id": "Q58992300",
          "label": "Oceanographers' lobby",
          "description": "scientific article published in Nature",
          "url": "//www.wikidata.org/wiki/Q58992300"
        }
      ]
    },
    "properties_matches": {
      "occupation": [
        {
          "id": "P106",
          "label": "occupation",
          "description": "occupation of a person; see also \"field of work\" (Property:P101), \"position held\" (Property:P39)",
          "url": "//www.wikidata.org/wiki/Property:P106"
        },
        {
          "id": "P3095",
          "label": "practiced by",
          "description": "type of agents that study this subject or work in this field",
          "url": "//www.wikidata.org/wiki/Property:P3095"
        },
        {
          "id": "P3989",
          "label": "members have occupation",
          "description": "some or all members of this group share the occupation",
          "url": "//www.wikidata.org/wiki/Property:P3989"
        },
        {
          "id": "P8629",
          "label": "Occupational Outlook Handbook ID",
          "description": "identifier for occupations in the Occupational Outlook Handbook",
          "url": "//www.wikidata.org/wiki/Property:P8629"
        },
        {
          "id": "P8734",
          "label": "O*NET OnLine code",
          "description": "code for an occupation in O*NET OnLine",
          "url": "//www.wikidata.org/wiki/Property:P8734"
        }
      ],
      "country of citizenship": [
        {
          "id": "P27",
          "label": "country of citizenship",
          "description": "the object is a country that recognizes the subject as its citizen",
          "url": "//www.wikidata.org/wiki/Property:P27"
        }
      ]
    },
    "sparql": "SELECT?s1\nWHERE {\n  ?s1  wdt:P27  wd:Q34.\n  ?s1  wdt:P106  wd:Q3546255.\n}"
  },
  {
    "question": "Give me all actors starring in Last Action Hero.",
    "entities": [
      "Last Action Hero"
    ],
    "properties": [
      "cast member"
    ],
    "entities_matches": {
      "Last Action Hero": [
        {
          "id": "Q858840",
          "label": "Last Action Hero",
          "description": "1993 film directed by John McTiernan",
          "url": "//www.wikidata.org/wiki/Q858840"
        },
        {
          "id": "Q3218370",
          "label": "Last Action Hero",
          "description": "1994 computer and video game",
          "url": "//www.wikidata.org/wiki/Q3218370"
        },
        {
          "id": "Q51206690",
          "label": "Last Action Hero",
          "description": "episode of Castle (S7 E9)",
          "url": "//www.wikidata.org/wiki/Q51206690"
        },
        {
          "id": "Q6494104",
          "label": "Last Action Hero",
          "description": "1993 pinball machine",
          "url": "//www.wikidata.org/wiki/Q6494104"
        },
        {
          "id": "Q15825336",
          "label": "Last Action Hero: Music from the Original Motion Picture",
          "description": "album",
          "url": "//www.wikidata.org/wiki/Q15825336"
        }
      ]
    },
    "properties_matches": {
      "cast member": [
        {
          "id": "P161",
          "label": "cast member",
          "description": "actor in the subject production [use \"character role\" (P453) and/or \"name of the character role\" (P4633) as qualifiers] [use \"voice actor\" (P725) for voice-only role] - [use \"recorded participant\" (P11108) for non-fiction productions]",
          "url": "//www.wikidata.org/wiki/Property:P161"
        }
      ]
    },
    "sparql": "SELECT?o1\nWHERE {\n  wd:Q858840  wdt:P161  ?o1.\n}"
  }
]