[
  {
    "question": "Give me the grandchildren of Bruce Lee.",
    "sparql": "SELECT DISTINCT ?uri WHERE { res:Bruce_Lee dbo:child ?child . ?child dbp:children ?uri }"
  },
  {
    "question": "Show me all museums in London.",
    "sparql": "SELECT DISTINCT ?uri WHERE { ?uri a dbo:Museum ; dbo:location res:London }"
  },
  {
    "question": "Give all swimmers that were born in Moscow.",
    "sparql": "SELECT DISTINCT ?uri WHERE { ?uri a dbo:Swimmer ; dbo:birthPlace res:Moscow }"
  },
  {
    "question": "Give me all cosmonauts.",
    "sparql": "SELECT DISTINCT ?uri WHERE { ?uri a dbo:Astronaut { ?uri dbo:nationality res:Russia } UNION { ?uri dbo:nationality res:Soviet_Union } }"
  },
  {
    "question": "Give me all Swiss non-profit organizations.",
    "sparql": "SELECT DISTINCT ?uri WHERE { ?uri dbo:type res:Nonprofit_organization { ?uri dbo:location res:Switzerland } UNION { ?uri dbo:location ?x . ?x dbo:country res:Switzerland } }"
  },
  {
    "question": "Show a list of soccer clubs that play in the Bundesliga.",
    "sparql": "SELECT DISTINCT ?uri WHERE { ?uri a dbo:SoccerClub ; dbo:league res:Bundesliga }"
  },
  {
    "question": "Give me all Danish movies.",
    "sparql": "SELECT DISTINCT ?uri WHERE { ?uri a dbo:Film ; dbo:country res:Denmark }"
  },
  {
    "question": "Give me all companies in Munich.",
    "sparql": "SELECT DISTINCT ?uri WHERE { ?uri a dbo:Company { ?uri dbo:location res:Munich } UNION { ?uri dbo:headquarter res:Munich } UNION { ?uri dbo:locationCity res:Munich } }"
  },
  {
    "question": "Give me the capitals of all countries that the Himalayas run through.",
    "sparql": "SELECT DISTINCT ?uri WHERE { res:Himalayas dbo:country ?country . ?country dbo:capital ?uri }"
  },
  {
    "question": "Give me all islands that belong to Japan.",
    "sparql": "SELECT DISTINCT ?uri WHERE { ?uri a dbo:Island ; dbo:country res:Japan }"
  },
  {
    "question": "Give me all soccer clubs in the Premier League.",
    "sparql": "SELECT DISTINCT ?uri WHERE { ?uri a dbo:SoccerClub ; dbo:league res:Premier_League }"
  },
  {
    "question": "Give me all world heritage sites designated within the past two years.",
    "sparql": "SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:WorldHeritageSite . { ?uri dbp:year '2013'^^xsd:integer . } UNION { ?uri dbp:year '2014'^^xsd:integer . } }"
  },
  {
    "question": "Give me all ESA astronauts.",
    "sparql": "SELECT DISTINCT ?uri WHERE { ?uri a dbo:Astronaut ; dbp:type res:European_Space_Agency }"
  },
  {
    "question": "Give me all federal chancellors of Germany.",
    "sparql": "SELECT DISTINCT ?uri WHERE { ?uri a dbo:Person { ?uri dbo:office \"Chancellor of Germany\" } UNION { ?uri dbp:office res:Chancellor_of_Germany } }"
  },
  {
    "question": "Show me everyone who was born on Halloween.",
    "sparql": "SELECT DISTINCT ?uri WHERE { ?uri a dbo:Person { ?uri dbo:birthDate ?date } UNION { ?uri dbp:birthDate ?date } res:Halloween dbp:date ?date }"
  },
  {
    "question": "Give me all actors who were born in Berlin.",
    "sparql": "SELECT DISTINCT ?uri WHERE { ?uri a dbo:Actor ; dbo:birthPlace res:Berlin }"
  },
  {
    "question": "Give me all the TV shows with Neil Patrick Harris.",
    "sparql": "SELECT DISTINCT ?uri WHERE { ?uri a dbo:TelevisionShow ; dbo:starring res:Neil_Patrick_Harris }"
  },
  {
    "question": "Give me all Swedish holidays.",
    "sparql": "SELECT DISTINCT ?uri WHERE { ?uri a dbo:Holiday ; dbo:country res:Sweden }"
  },
  {
    "question": "List all the musicals with music by Leonard Bernstein.",
    "sparql": "SELECT DISTINCT ?uri WHERE { ?uri a dbo:Musical ; dbo:musicBy res:Leonard_Bernstein }"
  },
  {
    "question": "Give me all companies in the advertising industry.",
    "sparql": "SELECT (COUNT(DISTINCT ?uri) AS ?c) WHERE { ?uri a dbo:Company { ?uri dbo:industry res:Advertising } UNION { ?uri dbo:industry ?industry FILTER regex(?industry, \"advertising\", \"i\") } }"
  },
  {
    "question": "Give me all Australian metalcore bands.",
    "sparql": "SELECT DISTINCT ?uri WHERE { ?uri a dbo:Band ; dbo:genre res:Metalcore { ?uri dbo:hometown res:Australia } UNION { ?uri dbo:hometown ?h . ?h dbo:country res:Australia } }"
  },
  {
    "question": "Give me all books written by Danielle Steel.",
    "sparql": "SELECT DISTINCT ?uri WHERE { ?uri a dbo:Book ; dbo:author res:Danielle_Steel }"
  },
  {
    "question": "Give me all Methodist politicians.",
    "sparql": "SELECT DISTINCT ?uri WHERE { ?uri a dbo:Politician ; dbo:religion res:Methodism }"
  },
  {
    "question": "Give me all actors called Baldwin.",
    "sparql": "SELECT DISTINCT ?uri WHERE { ?uri foaf:surname 'Baldwin'@en . { ?uri dbo:occupation res:Actor . } UNION { ?uri rdf:type dbo:Actor . } }"
  },
  {
    "question": "Show me all songs from Bruce Springsteen released between 1980 and 1990.",
    "sparql": "SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Song . ?uri dbo:artist res:Bruce_Springsteen . ?uri dbo:releaseDate ?date . FILTER (?date >= '1980-01-01'^^xsd:date && ?date <= '1990-12-31'^^xsd:date) }"
  },
  {
    "question": "Give me a list of all lakes in Denmark.",
    "sparql": "SELECT DISTINCT ?uri WHERE { { ?uri a dbo:Lake ; dbo:country res:Denmark } UNION { ?uri a yago:LakesOfDenmark } }"
  },
  {
    "question": "Show me all English Gothic buildings in Kent.",
    "sparql": "SELECT ?uri WHERE { ?uri a dbo:Building ; dbo:architecturalStyle res:English_Gothic_architecture ; dbo:location res:Kent }"
  },
  {
    "question": "Give me all films produced by Hal Roach.",
    "sparql": "SELECT DISTINCT ?uri WHERE { ?uri a dbo:Film ; dbo:producer res:Hal_Roach }"
  },
  {
    "question": "Give me all movies with Tom Cruise.",
    "sparql": "SELECT DISTINCT ?uri WHERE { ?uri a dbo:Film ; dbo:starring res:Tom_Cruise }"
  },
  {
    "question": "List the seven kings of Rome.",
    "sparql": "SELECT DISTINCT ?uri WHERE { ?uri dbp:title res:King_of_Rome }"
  },
  {
    "question": "Give me all people that were born in Vienna and died in Berlin.",
    "sparql": "SELECT DISTINCT ?uri WHERE { ?uri dbo:birthPlace res:Vienna ; dbo:deathPlace res:Berlin }"
  },
  {
    "question": "Show me all the breweries in Australia.",
    "sparql": "SELECT DISTINCT ?uri WHERE { ?uri a dbo:Brewery { ?uri dbo:location res:Australia } UNION { ?uri dbo:location ?x . ?x dbo:country res:Australia } }"
  },
  {
    "question": "Give me all films produced by Steven Spielberg with a budget of at least $80 million.",
    "sparql": "SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Film . ?uri dbo:director res:Steven_Spielberg . ?uri dbo:budget ?b . FILTER( xsd:double(?b) >= 8.0E7 ) }"
  },
  {
    "question": "Give me all soccer clubs in Spain.",
    "sparql": "SELECT DISTINCT ?uri WHERE { ?uri a dbo:SoccerClub { ?uri dbo:ground res:Spain } UNION { ?uri dbp:ground ?ground FILTER regex(?ground, \"Spain\") } }"
  }
]